export default function OfferPage() {
  return (
    <main className="legal container legal-page">
      <h1 className="page-title">Публичная оферта</h1>
      <p className="legal-subtitle">
        Договор купли-продажи товаров дистанционным способом/через интернет-магазин
      </p>
      <p>
        <strong>Дата размещения:</strong> "16" апреля 2026
      </p>
      <p>
        <strong>г. Омск</strong>
      </p>

      <h2>1. Основные понятия и определения:</h2>
      <p>
        <strong>1.1. Продавец</strong> – Жумабеков Даниал Азатович, ИНН 552503032706;
      </p>
      <p>
        <strong>1.2. Публичная оферта</strong> – публичное предложение Продавца,
        адресованное неопределённому кругу лиц, заключить с Продавцом договор
        купли-продажи товаров дистанционным способом (далее — «Договор»);
      </p>
      <p>
        <strong>1.3. Покупатель</strong> – физическое лицо, использующее программные
        средства просмотра контента в сети Интернет, принимающее условия настоящего
        Договора и выражающее желание купить товар, сведения о котором размещены на
        сайте https://kaburo.ru;
      </p>
      <p>
        <strong>1.4. Товар</strong> – изделия российского производства, а именно,
        одежда, аксессуары, предлагаемые к продаже на сайте https://kaburo.ru;
      </p>
      <p>
        <strong>1.5. Интернет-магазин</strong> – сайт в сети Интернет, расположенный
        по адресу https://kaburo.ru на котором любой Покупатель может ознакомиться с
        представленными Товарами, их описанием и ценами, выбрать определённый Товар,
        способ оплаты, сформировать и отправить Заказ Продавцу;
      </p>
      <p>
        <strong>1.6. Заказ</strong> – оформленный запрос Покупателя на приобретение, оплату и доставку Товара, выбранного на сайте https://kaburo.ru, отправленный Продавцу посредством сети Интернет. Срок обработки Заказа варьируется от 14 (Четырнадцати) дней, но в любом случае зависит от общего количества Заказов, не имеет стандартизированных форматов и сроков обработки;
      </p>
      <p>
        <strong>1.7. Служба доставки</strong> – оператор российской государственной почтовой сети www.cdek.ru;
      </p>
      <p>
        <strong>1.8. Сайт</strong> – сайт Продавца в сети Интернет, расположенный по адресу https://kaburo.ru;
      </p>
      <p>
        <strong>1.9. Предзаказ</strong> – (предварительный заказ) – это изъявление Покупателем намерения купить/забронировать какой-либо определенный Товар с последующей оплатой в указанные в настоящем Договоре сроки. Если на Товаре есть метка «Предзаказ», это означает, что в данный момент Товара нет в наличии, но он доступен к бронированию. Сроки отправки Товаров из категории «Предзаказ» определяются индивидуально, но доставка такого Товара в любом случае осуществляется в течение 60 (Шестидесяти) рабочих дней с даты оплаты Товара Покупателем.
      </p>

      <h2>2. Общие положения</h2>
      <p>
        <strong>2.1.</strong> Заказывая Товар на сайте https://kaburo.ru, Покупатель
        выражает свое согласие с вышеизложенными условиями продажи Товара и принимает
        их.
      </p>
      <p>
        <strong>2.2.</strong> Настоящие условия продажи Товара, а также информация о
        Товаре, представленная на сайте https://kaburo.ru, являются публичной офертой
        в соответствии со ст. 435 и п.2 ст. 437 Гражданского кодекса Российской
        Федерации.
      </p>
      <p>
        <strong>2.3.</strong> Продавец имеет право вносить изменения и дополнения в настоящий Договор, размещенный по адресу https://kaburo.ru, при этом такие изменения вступают в силу с даты размещения на сайте Продавца.
      </p>
      <p>
        <strong>2.4.</strong> Нажимая кнопку «Оформить Заказ» при формировании Заказа на сайте, Пользователь подтверждает свое согласие с условиями продажи Товара, изложенными в настоящем Договоре.
      </p>
      <p>
        <strong>2.5.</strong> Настоящий Договор считается заключенным с момента выдачи/отправки Продавцом Покупателю кассового чека, подтверждающего полную оплату Товара, или с момента получения Продавцом сообщения о намерении Покупателя приобрести Товар, нажав кнопку «Оформить Заказ».
      </p>

      <h2>3. Предмет договора</h2>
      <p>
        <strong>3.1.</strong> Продавец предоставляет возможность любому физическому
        лицу приобретать для личных, семейных или иных нужд, не связанных с
        осуществлением Покупателем Предпринимательской деятельности, Товары,
        представленные на сайте https://kaburo.ru.
      </p>
      <p>
        <strong>3.2.</strong> Данный Договор распространяется на все виды Товаров, представленные на сайте https://kaburo.ru, пока такие предложения с описанием присутствуют в каталоге сайта.
      </p>

      <h2>4. Порядок оформления заказа</h2>
      <p>
        <strong>4.1.</strong> Оформление Заказа в Интернет-магазине осуществляется
        Покупателем самостоятельно. При оформлении Заказа Покупатель заполняет электронную форму Заказа Товара и отправляет сформированный Заказ Продавцу посредством системы сайта.
      </p>
      <p>
        <strong>4.2.</strong> При регистрации на сайте Интернет-магазина Покупатель обязуется предоставить следующую регистрационную информацию:
      </p>
      <ul>
        <li>фамилия, имя Покупателя или указанного им лица (получателя);</li>
        <li>дата рождения;</li>
        <li>адрес, по которому следует доставить Товар (если доставка до адреса Покупателя);</li>
        <li>адрес электронной почты;</li>
        <li>контактный телефон.</li>
      </ul>
      <p>
        <strong>4.3.</strong> Наименование, количество, ассортимент, цена выбранного Покупателем Товара указываются в корзине Покупателя на сайте Интернет-магазина.
      </p>
      <p>
        <strong>4.4.</strong> Продавец не несет ответственности за содержание и достоверность информации, предоставленной Покупателем при оформлении Заказа.
      </p>
      <p>
        <strong>4.5.</strong> Покупатель несет ответственность за достоверность предоставленной информации при оформлении Заказа.
      </p>
      <p>
        <strong>4.8.</strong> Фотографии Товара, размещённые на сайте https://kaburo.ru, являются иллюстрациями и могут отличаться от фактического внешнего вида Товара. Изображения могут быть получены с использованием профессионального оборудования, а также обработаны с применением графических редакторов и технологий искусственного интеллекта с целью улучшения качества изображения, освещения, цветопередачи и детализации.
      </p>
      <p>
        <strong>4.11.</strong> Доставка Товара осуществляется по согласованию Покупателя и Продавца посредством службы доставки Почта России pochta.ru, www.cdek.ru. Срок доставки Товара Покупателю рассчитывается индивидуально, при этом минимальный срок доставки Товара составляет 7 (Семь) дней с даты оплаты такого Товара.
      </p>
      <p>
        <strong>4.12.</strong> Оплата полной стоимости доставки осуществляется за счет Покупателя.
      </p>
      <p>
        <strong>4.13.</strong> Продажа Товара осуществляется путем 100% (Сто процентов) предоплаты стоимости Товара.
      </p>
      <p>
        <strong>4.14.</strong> Оплата производится путем использования платежной системы на сайте в срок не позднее 30 (Тридцати) минут с момента оформления Заказа.
      </p>

      <h2>5. Стоимость Товара и способы оплаты</h2>
      <p>
        <strong>5.1.</strong> Цена на Товар, представленный на сайте https://kaburo.ru, указана в рублях.
      </p>
      <p>
        <strong>5.2.</strong> Цена Товара на сайте https://kaburo.ru может быть изменена Продавцом в одностороннем порядке. При этом цена на заказанный Покупателем Товар изменению не подлежит.
      </p>
      <p>
        <strong>5.4.</strong> Оплата Товара производится банковской картой при оформлении Заказа на сайте с использованием платежной системы в срок не позднее 30 (Тридцати) минут с момента оформления Заказа.
      </p>
      <p>
        <strong>5.6.</strong> В случае отсутствия оплаты Товара в указанные сроки, Заказ отменяется автоматически.
      </p>

      <h2>6. Гарантия, отмена Заказа, возврат Товара и предоплаты</h2>
      <p>
        <strong>6.1.</strong> Гарантийный срок на Товар равен 7 (Семи) дням в соответствии с пунктом 21 постановления правительства РФ от 27.09.2007 N 612 «Об утверждении правил продажи товаров дистанционным способом») и исчисляется с момента передачи Товара Покупателю.
      </p>
      <p>
        <strong>6.2.</strong> Гарантия распространяется на производственный брак и не распространяется на дефекты, образовавшиеся в результате: механических повреждений (царапин, разрывов, потертостей и т.д.); воздействия экстремальных температур, растворителей, кислот, воды; неправильного использования (эксплуатации, стирки); естественного износа.
      </p>
      <p>
        <strong>6.4.</strong> Покупатель имеет право на возврат или обмен Товара в течение 7 (Семи) дней со дня получения Товара, если Товар не был в использовании, а также имеется подтверждающий документ (чек).
      </p>
      <p>
        <strong>6.4.1.</strong> Возврат или обмен возможен в случаях:
      </p>
      <ul>
        <li>ненадлежащего качества Товара;</li>
        <li>несоответствия Товара заказу (цвет, размер, модель и т.п.);</li>
        <li>дефектов или повреждений, возникших по вине Продавца или перевозчика.</li>
      </ul>
      <p>
        <strong>6.5.</strong> Возврат денежных средств на карту за возвращенный/отмененный Товар осуществляется в течение 10 (Десяти) дней с момента получения Интернет-магазином письменного заявления Покупателя.
      </p>

      <h2>7. Ответственность</h2>
      <p>
        <strong>7.1.</strong> За неисполнение или ненадлежащее исполнение своих обязательств по Договору Стороны несут ответственность в соответствии с действующим законодательством РФ.
      </p>
      <p>
        <strong>7.2.</strong> Продавец несет ответственность за неисполнение или ненадлежащее исполнение обязательств по настоящему Договору в соответствии с действующим законодательством Российской Федерации.
      </p>

      <h2>8. Прочие условия</h2>
      <p>
        <strong>8.1.</strong> Покупатель обязуется дать свое согласие на обработку персональных данных путем подтверждения Положения о политике конфиденциальности персональных данных, размещенное на сайте.
      </p>
      <p>
        <strong>8.2.</strong> Продавец не несёт ответственности за любые последствия, убытки, вред здоровью или имуществу, а также за любые иные последствия, прямо или косвенно возникающие в связи с использованием Товара не по назначению.
      </p>
      <p>
        <strong>8.5.</strong> В случае возникновения вопросов и претензий со стороны Покупателя он вправе обратиться к Продавцу посредством отправки личного сообщения в адрес официальной страницы Интернет-магазина в социальных сетях. Все возникающие споры стороны будут стараться решить путем переговоров, при недостижении соглашения, соответствующий спор подлежит разрешению в суде.
      </p>

      <div style={{ marginTop: '3rem', textAlign: 'right' }}>
        <p>
          <strong>Утверждено</strong>
        </p>
        <p>
          <strong>Жумабеков Д.А.</strong>
        </p>
      </div>
    </main>
  )
}
