export default function PrivacyPage() {
  return (
    <main className="legal container legal-page">
      <h1 className="page-title">
        Политика конфиденциальности и обработки персональных данных
      </h1>

      <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
      <p>
        <strong>1.1.</strong> Настоящее Положение о политике конфиденциальности и
        обработки персональных данных является официальным и утвержденным документом
        Жумабеков Даниал Азатович, ИНН 552503032706 (далее – «Оператор») (Контактный
        адрес электронной почты Оператора: kaburo-club@mail.ru) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных физических лиц (далее – «Субъект персональных данных», «Субъект»), пользующихся сервисами, информацией, услугами, программами и продуктами Оператора на сайте, расположенном на доменном имени https://kaburo.ru (далее – «Сайт») и официальных страниц Оператора в социальных сетях.
      </p>

      <p>
        <strong>1.2.</strong> Настоящее Положение применяется в отношении всех персональных данных, которые могут быть получены от физических лиц Оператором в процессе регистрации физических лиц на Сайте и оформления ими заказов на Сайте.
      </p>

      <p>
        <strong>1.3.</strong> Настоящее Положение применяется Оператором в соответствии с Федеральным законом от 27.07.2006 г. N 152-ФЗ «О персональных данных», Федеральным законом от 13.03.2006 N 38-ФЗ «О рекламе» и иными нормативными актами в области защиты персональных данных, действующими на территории Российской Федерации.
      </p>

      <p>
        <strong>1.4.</strong> Оператор ставит своей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиту прав на неприкосновенность частной жизни, личную и семейную тайну от несанкционированного доступа и разглашения.
      </p>

      <p>
        <strong>1.5.</strong> Обработка персональных данных осуществляется на законной и справедливой основе, действуя разумно и добросовестно и на основе принципов:
      </p>
      <ul>
        <li>законности целей и способов обработки персональных данных;</li>
        <li>добросовестности;</li>
        <li>соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных, а также полномочиям Оператора;</li>
        <li>соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных целям обработки персональных данных.</li>
      </ul>

      <p>
        <strong>1.6.</strong> Оператор может осуществлять обработку следующих персональных данных:
      </p>
      <ul>
        <li>фамилия, имя;</li>
        <li>дата рождения;</li>
        <li>номер телефона;</li>
        <li>адрес электронной почты;</li>
        <li>данные об оказанных и оказываемых Субъекту персональных данных услугах, в том числе история обращений Субъекта;</li>
        <li>история обращений Субъекта персональных данных, в том числе присылаемые Субъектом при обращениях к Оператору сообщения Субъекта, документы;</li>
        <li>адрес доставки Товара Оператора.</li>
      </ul>

      <p>
        <strong>1.7.</strong> При использовании сервисов Сайта Оператор обрабатывает также иные обезличенные данные, которые автоматически передаются в процессе использования Сайта посредством установленного на компьютере программного обеспечения:
      </p>
      <ul>
        <li>сведения об используемом браузере (или иной программе, с помощью которой осуществляется доступ к сайту);</li>
        <li>IP-адрес;</li>
        <li>данные файлов cookie.</li>
      </ul>

      <p>
        <strong>1.9.</strong> Оператор осуществляет обработку персональных данных Субъектов персональных данных путем ведения баз данных автоматизированным, механическим, ручным способами в целях:
      </p>
      <ul>
        <li><strong>1.9.1.</strong> обработки заказов, запросов или других действий Субъекта персональных данных, связанных с посещением Сайта, заказом услуг включая, но не ограничиваясь услугами по запросу цен на представленные в каталогах товары;</li>
        <li><strong>1.9.2.</strong> в случае выраженного согласия Субъекта персональных данных, в целях продвижения товаров, работ и услуг Оператора на рынке, оповещения о проводимых акциях, мероприятиях, скидках, проведения маркетинговых кампаний Оператора.</li>
      </ul>

      <p>
        <strong>1.10.</strong> Оператор осуществляет обработку персональных данных посредством совершения любого действия (операции) или совокупности действий (операций), включая следующие:
      </p>
      <ul>
        <li>сбор;</li>
        <li>запись;</li>
        <li>систематизацию;</li>
        <li>накопление;</li>
        <li>хранение;</li>
        <li>уточнение (обновление, изменение);</li>
        <li>извлечение;</li>
        <li>использование;</li>
        <li>передачу (распространение, предоставление, доступ);</li>
        <li>обезличивание;</li>
        <li>блокирование;</li>
        <li>удаление;</li>
        <li>уничтожение.</li>
      </ul>

      <p>
        <strong>1.11.</strong> При проведении платежей предоставляемая Субъектом персональная информация (имя, адрес, телефон, e-mail, номер банковской карты) не сохраняется на Web-сервере Оператора и предоставляется только банку-партнеру. Никакая информация о платежах, кроме уведомления об оплате, банком-партнером Оператора не передается. Безопасность обработки платежей, в том числе и Интернет-платежей, гарантируется банками-партнерами. Все ресурсы банков-партнеров соответствуют стандартам безопасности PCI DSS, имеют все необходимые разрешения и сертификаты.
      </p>

      <h2>2. ПОЛУЧЕНИЕ, ИСПОЛЬЗОВАНИЕ И РАСКРЫТИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
      <p>
        <strong>2.1.</strong> Оператор получает и начинает обработку персональных данных Субъекта с момента получения его согласия. Согласие на обработку персональных данных может быть дано Субъектом персональных данных в любой форме, позволяющей подтвердить факт получения согласия, если иное не установлено федеральным законом, в том числе посредством совершения Субъектом персональных данных конклюдентных действий.
      </p>

      <p>
        <strong>2.2.</strong> Персональные данные Субъектов персональных данных получаются Оператором:
      </p>
      <ul>
        <li>путем личной передачи Субъектом персональных данных при внесении сведений в учетные формы в электронном виде на Сайте;</li>
        <li>путем личной передачи Субъектом персональных данных при внесении сведений в электронном виде на Сайте;</li>
        <li>иными способами, не противоречащими законодательству Российской Федерации и требованиям международного законодательства о защите персональных данных.</li>
      </ul>

      <p>
        <strong>2.3.</strong> Согласие на обработку персональных данных считается предоставленным посредством совершения Субъектом персональных данных любого действия или совокупности следующих действий:
      </p>
      <ul>
        <li>регистрации на Сайте Оператора;</li>
        <li>проставления на Сайте в соответствующей форме отметки о согласии на обработку персональных данных в объеме, для целей и в порядке, предусмотренных в предлагаемом перед получением согласия для ознакомления тексте;</li>
        <li>сообщения персональных данных в письменной форме в процессе оформлении заказа.</li>
      </ul>

      <p>
        <strong>2.5.</strong> Субъект персональных данных может в любой момент получить доступ к своим персональным данным, имеет право исправить, удалить, перенести, ограничить обработку таких данных, а также отозвать свое согласие на обработку персональных данных при условии, что подобная процедура не нарушает требований законодательства Российской Федерации.
      </p>

      <h2>3. СВЕДЕНИЯ О РЕАЛИЗУЕМЫХ ТРЕБОВАНИЯХ К ЗАЩИТЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
      <p>
        <strong>3.1.</strong> Деятельность Оператора по обработке персональных данных неразрывно связана с защитой Оператором конфиденциальности полученной информации.
      </p>

      <p>
        <strong>3.2.</strong> Оператор требует от иных лиц, получивших доступ к персональным данным, не раскрывать третьим лицам и не распространять персональные данные без согласия Субъекта персональных данных, если иное не предусмотрено федеральным законом.
      </p>

      <p>
        <strong>3.4.</strong> С целью обеспечения безопасности персональных данных при их обработке Оператор принимает необходимые и достаточные правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении них.
      </p>

      <p>
        <strong>3.7.</strong> Оператор обязуется не разглашать полученную от Субъекта персональных данных информацию. Не считается нарушением предоставление Оператором информации агентам и третьим лицам, действующим на основании договора с Оператором, для исполнения обязательств перед Субъектом персональных данных.
      </p>

      <h2>4. СОГЛАСИЕ НА ПОЛУЧЕНИЕ РЕКЛАМНОЙ ИНФОРМАЦИИ ПО СЕТЯМ ЭЛЕКТРОСВЯЗИ</h2>
      <p>
        <strong>4.1.</strong> Оставляя Заказ на сайте Оператора, Субъект автоматически соглашается на получение рассылки/рекламной информации.
      </p>

      <p>
        <strong>4.2.</strong> Давая согласие, указанное в п. 4.1. настоящего Положения, Субъект персональных данных подтверждает, что действует по своей воле и в своих интересах, а также то, что указанные персональные данные являются достоверными.
      </p>

      <h2>5. ТРАНСГРАНИЧНАЯ ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
      <p>
        <strong>5.1.</strong> Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.
      </p>

      <h2>6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
      <p>
        <strong>6.1.</strong> Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, посредством отправки сообщения администратору официальной страницы Интернет-магазина в социальных сетях. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Положение действует бессрочно до замены новой версией. Актуальная версия Положения в свободном доступе расположена на Сайте.
      </p>

      <div style={{ marginTop: '3rem', textAlign: 'right' }}>
        <p>
          <strong>Утверждено</strong>
        </p>
        <p>
          <strong>Жумабеков Д.А.</strong>
        </p>
      </div>
    </main>
  )
}
